Repository: CanePlayz/HDGraph.Core
Catalog: HDGraph/HDGraphGUI/Resources/ApplicationMessages.*.resx
Languages: fr

# abreviationGOctet
source: GB
fr: Go

# abreviationKOctet
source: KB
fr: Ko

# abreviationMOctet
source: MB
fr: Mo

# abreviationOctet
source: B.
fr: o.

# abreviationTOctet
source: TB
fr: To

source: All files
fr: Tous les fichiers

# AppRestartRequiredToApplyLangage
source: An application restart is required to apply the new langage. Are you sure ?
fr: Un redémarrage de l'application est nécessaire pour appliquer ce paramètre. Voulez-vous continuer ?

# CriticalError
source: A critical error occured. Error is logged, and application will stop. Please send the application log to the HDGraph team (contact: http://hdgraph.sourceforge.net). Thank you.
fr: Une erreur critique est survenue et l'application doit s'arreter. L'erreur a été enregistrée dans le fichier de log. Merci d'envoyer le fichier de log à l'équipe HDGraph afin de corriger cette erreur (voir http://hdgraph.sourceforge.net).

# CursorHoverDirectory
source: Pointed directory : {0}
fr: Le curseur se trouve sur {0}

# CursorHoverFreeSpace
source: Your cursor is over the part representing the disk free space.
fr: Le curseur pointe sur la zone représentant l'espace libre du disque.

# CursorHoverNoDirectory
source: No directory pointed.
fr: Le curseur ne survole aucun répertoire.

# CursorHoverUnknownPart
source: Your cursor is over the part representing the non-calculable files.
fr: Le curseur pointe sur une zone représentant les fichiers non calculables.

# DeleteInProgress
source: HDGraph is deleting the folder...
fr: Suppression du répertoire en cours...

# DeletionCompleteMsg
source: Folder successfully deleted !
fr: Répertoire supprimé avec succès !

# DetailsForFolderFormTitle
source: Details view for folder "{0}"...
fr: Vue détaillée du répertoire "{0}"...

# Error
source: HDGraph Error
fr: Erreur HDGraph

# ErrorDeletingFolder
source: An error occured while deleting the folder. Some files were not deleted. You probably don't have the right permissions on the folder or its files, or one file might be read only. {1}Error detail : {0}{1}{1}Do you want to open the folder to investigate the problem or delete the folder manually ?
fr: Une erreur s'est produite lors de la suppression. Il est problable que seule une partie des fichiers ai été supprimée. Détail de l'erreur : {0}

# ErrorInConfigLanguage
source: An error in the configuration file prevent the application to load the appropriate language. Please verify that the langage code is correct in your config file !
fr: Une erreur dans le fichier de configuration empêche l'application de charger la langue appropriée. Vérifiez le code de langue du fichier de config !

# ErrorInConfigLanguageTitle
source: Language code error in config file
fr: Le code de la langue du fichier de config est erroné.

# ErrorLoading
source: {0} : Scan ERROR : {1}
fr: {0} : Erreur lors du chargement : {1}

# ErrorLoadingFile
source: Error loading file {0}. Load action canceled. Error detail :
fr: Erreur lors du chargement du fichier {0}. Le chargement de ce fichier a été annulé. Détail de l'erreur :

# ErrorNegativeSizeOfUnknownParts
source: Error : the non calculable files have a negative size. This means that you don't have refreshed the whole disk, or that your disk has one or more hard link or junction links (in this case, linked files are counted twice ou more).
fr: Erreur : les fichiers non calculables ont une taille négative. Cela signifie que vous n'avez rafraîchi qu'une partie du graphe, ou que votre disque comporte des alias de répertoires (appelés Hard Links et Junction Links). Ceux-ci sont alors comptés en double (ou plus).

# ExplorerContextMenuAction
source: Draw space with HDGraph
fr: Afficher l'espace avec HDGraph

# FolderIsEmpty
source: Selected folder is empty.
fr: Le dossier séléctionné est vide.

source: Free space
fr: Espace libre

# FreeSpaceDescription
source: Your drive free space is about {0} ({1} bytes).
fr: L'espace libre de ce lecteur s'élève à {0} ({1} octets).

# GoingToDeleteFolderMsg
source: This action will permanently delete the folder "{0}" and all its content. Are you sure ?
fr: Cette action va définitivement supprimer le répertoire "{0}" ainsi que la totalité de son contenu. Cliquez sur Ok pour confirmer.

# GoingToDeleteFolderTitle
source: Your are about to delete a folder
fr: Vous ête sur le point de supprimer un répertoire...

# GraphGuideLine
source: Step by step instructions : 1) Choose a directory to analyse on the top combo box. 2) Press the "Scan / Refresh" button. 3) Wait for the end of the analysis.
fr: Pour commencer : 1) Choissez un répertoire à analyser dans la zone de texte ci-dessus. 2) Cliquez sur le bouton "Scanner / Rafraîchir". 3) Attendez la fin de l'analyse.

# GraphLoadedFromDate
source: Analyze loaded. Disk snapshot date is {0}.
fr: Graphique chargé. L'analyze date du {0}.

# GraphRefreshed
source: Graph refresh completed !
fr: Rafraîchissement du graphe terminé !

# HdgAlreadyDesIntegratedInExplorer
source: HDG is currently NOT integrated in the explorer context menu. Nothing to do !
fr: HDG n'est pas intégré à l'explorateur, impossible donc de le retirer !

# HdgAlreadyIntegratedInExplorer
source: HDG has already been integrated in the explorer. Nothing to do !
fr: HDG est déjà intégré à l'explorateur !

# HdgCorrectlyDesIntegratedInExplorer
source: HDG has been successfully removed from the explorer context menu.
fr: HDG a été retiré avec succès du menu contextuel de l'explorateur.

# HdgCorrectlyIntegratedInExplorer
source: Integration successfull ! Try to right click on a folder...
fr: HDG a été ajouté avec succès au menu contextuel de l'explorateur. Testez en faisant un clic droit sur un dossier...

# HdgDescription
source: HDG is a free tool allowing to graphically display the hard disk space usage. It shows all the directories and subdirectories of the hard drive on a single graph, allowing to see the the largest directories at a glance.
fr: HDG est un utilitaire gratuit permettant d'afficher l'occupation de l'espace disque sous forme graphique, via des camemberts imbriqués. Il permet ainsi de voir d'un seul coup d'oeil les répertoires les plus volumineux de votre disque dur.

# HDGFiles
source: HDG Graphics Files
fr: Fichiers graphiques HDG

# HdgLicenceDescription
source: This software is a computer program whose purpose is to draw multi-level pie charts of disk space, in order to easily identify the biggest folders of the hard disk. This software is governed by the CeCILL license under French law and abiding by the rules of distribution of free software. You can use, modify and/or redistribute the software under the terms of the CeCILL license as circulated by CEA, CNRS and INRIA at the following URL "http://www.cecill.info". As a counterpart to the access to the source code and rights to copy, modify and redistribute granted by the license, users are provided only with a limited warranty and the software's author, the holder of the economic rights, and the successive licensors have only limited liability. In this respect, the user's attention is drawn to the risks associated with loading, using, modifying and/or developing or reproducing the software by the user in light of its specific status of free software, that may mean that it is complicated to manipulate, and that also therefore means that it is reserved for developers and experienced professionals having in-depth computer knowledge. Users are therefore encouraged to load and test the software's suitability as regards their requirements in conditions enabling the security of their systems and/or data to be ensured and, more generally, to use and operate it in the same conditions as regards security. The fact that you are presently reading this means that you have had knowledge of the CeCILL license and that you accept its terms.
fr: Ce logiciel est un programme informatique servant à représenter l'espace du disque dur sous forme graphique, dans l'objectif d'identifier ses répertoires les plus volumineux. Ce logiciel est régi par la licence CeCILL soumise au droit français et respectant les principes de diffusion des logiciels libres. Vous pouvez utiliser, modifier et/ou redistribuer ce programme sous les conditions de la licence CeCILL telle que diffusée par le CEA, le CNRS et l'INRIA sur le site "http://www.cecill.info". En contrepartie de l'accessibilité au code source et des droits de copie, de modification et de redistribution accordés par cette licence, il n'est offert aux utilisateurs qu'une garantie limitée. Pour les mêmes raisons, seule une responsabilité restreinte pèse sur l'auteur du programme, le titulaire des droits patrimoniaux et les concédants successifs. A cet égard l'attention de l'utilisateur est attirée sur les risques associés au chargement, à l'utilisation, à la modification et/ou au développement et à la reproduction du logiciel par l'utilisateur étant donné sa spécificité de logiciel libre, qui peut le rendre complexe à manipuler et qui le réserve donc à des développeurs et des professionnels avertis possédant des connaissances informatiques approfondies. Les utilisateurs sont donc invités à charger et tester l'adéquation du logiciel à leurs besoins dans des conditions permettant d'assurer la sécurité de leurs systèmes et ou de leurs données et, plus généralement, à l'utiliser et l'exploiter dans les mêmes conditions de sécurité. Le fait que vous puissiez accéder à cet en-tête signifie que vous avez pris connaissance de la licence CeCILL, et que vous en avez accepté les termes.

# HdgLicenceName
source: "CeCILL v2" License
fr: Programme sous licence "CeCILL v2".

# HelpFilename
source: HDGraph-en.chm
fr: HDGraph-fr.chm

# HistorySuccessfullyCleared
source: Path history list successfully cleared !
fr: Historique des répertoires analysés effacé avec succès.

# IncompatibleVersionError
source: Unable to load file: it has been created with an incompatible version of HDGraph.
fr: Impossible de charger le fichier. Il a été créé avec une version incompatible de HDGraph.

# InvalidPathError
source: The specified path is not valid. Please verify it ! Scan aborted.
fr: Le chemin spécifié n'est pas valide ! Le scan a été annulé. Vérifiez que vous avez entré un chemin valide !

# languageApplied
source: Language setting has been modified. Until you restart the application, only new windows will use the correct settings.
fr: Les paramètres de langue ont été modifiés. Avant le prochain démarrage de l'application, seules les nouvelles fenêtres seront affectées.

# languageAppliedTitle
source: Langage setting modified !
fr: Paramètres de langue modifiés !

# languageId
source: none
fr: fr-FR

source: Loading language list...
fr: Chargement de la liste des langues...

# OperationFailedTitle
source: Operation failed
fr: Echec de l'opération

# OperationSuccessfullTitle
source: Operation successfull
fr: Operation réussie

# PleaseChooseDirectory
source: Please choose the directory to analyse :
fr: Veuillez sélectionner le répertoire à analyser :

source: Scanning
fr: Analyse de

# statusReady
source: Ready.
fr: Prêt.

# UnableToDesIntegrateInExplorer
source: An error prevent you to do the operation. Perhaps that you don't have rights to do this (try as administrator if you're not). Error detail : {0}.
fr: Une erreur s'est produite, aboutissant à l'échec de l'opération. Vous ne disposez peut-être pas des droits suffisants pour effectuer cette opération. Essayez en tant qu'administrateur si vous ne l'êtes pas déjà. Détail de l'erreur : {0}.

# UnableToIntegrateInExplorer
source: An error prevent you to do the operation. Perhaps that you don't have rights to do this (try as administrator if you're not). Error detail : {0}.
fr: Une erreur s'est produite, aboutissant à l'échec de l'opération. Vous ne disposez peut-être pas des droits suffisants pour effectuer cette opération. Essayez en tant qu'administrateur si vous ne l'êtes pas déjà. Détail de l'erreur : {0}.

# UnableToShowUnknownContent
source: The content of this folder has not been memorized during the HDGraph scan. Increase the "Calculation max depth" or browse this folder on the graph to be able to show its content.
fr: Le contenu de ce répertoire n'a pas été mémorisé lors du scan d'HDGraph. Augmentez le niveau de répertoires à mémoriser sur la fenêtre principale ou centrez le graph sur ce répertoire pour pouvoir voir son contenu détaillé.

# UnexpectedErrorDuringAnalysis
source: An unexpected error occured during scan. It has been logged. Please send the application log to the HDGraph team (contact: http://hdgraph.sourceforge.net). Thank you.
fr: Une erreur inconnue est survenue durant le scan. L'erreur a été enregistrée dans le fichier de log. Merci d'envoyer le fichier de log à l'équipe HDGraph afin de corriger cette erreur (voir http://hdgraph.sourceforge.net).

source: Unknown files
fr: Fichiers inconnus

# UnknownPartDescription
source: Your drive contains about {0} ({1} bytes) of data that HDGraph is unable to scan.\nThis includes : \n - unreadable files (due to access restrictions)\n - lost space (due to cluster sizes)\n - folders and files which path is greater than 255 chars\n - etc.
fr: Ce lecteur contient {0} ({1} octets) de données que HDGraph n'est pas en mesure de scanner.\nCela inclut : \n - les fichiers inaccessibles (accès refusés)\n - l'espace perdu (dû à la taille des clusters)\n - les fichiers et répertoires dont le chemin est supérieur à 255 caractères\n - etc.

# UserCanceledAnalysis
source: Directory scan has been aborted by user. Please launch a new scan.
fr: L'analyse du disque a été stoppée par l'utilisateur. Veuillez lancer une nouvelle analyse.

# PleaseWaitWhileDrawing
source: Please wait while drawing the graph...
fr: Veuillez patienter, construction du graphique en cours...

# ResizeInProgressByUser
source: [ Resize preview ]
fr: [ Aperçu du redimentionnement ]

source: Unknown
fr: Inconnu

# SomeElementsSkipped
source: {0} elements skipped due to scan errors.
fr: {0} éléments ignorés (échecs d'analyse)

# OneElementSkipped
source: 1 element skipped due to scan error.
fr: 1 élément ignoré (échec d'analyse)

# Tip1_RightClick
source: You can right click on any directory on the graph to have more options : open it in Windows Explorer, delete it, etc.
fr: Vous pouvez effectuer un click droit sur n'importe quel répertoire dessiné sur le graphique pour disposer de plus d'options !
